[["Document", "NON-DISCLOSURE AGREEMENT (NDA). DATE:. NOVEMBER 15, 2024. DISCLOSING PARTY:. FALLCORP TECHNOLOGIES INC, five thousand, eight hundred and ninety-one AV DECELLES,. MONTREAL, CANADA. RECEIVING PARTY:. MICKAEL HUANG YUE CHUAN, BROSSARD, CANADA. THIS NON-DISCLOSURE AGREEMENT (HEREINAFTER REFERRED TO AS THE. AGREEMENT) IS ENTERED INTO BY AND BETWEEN THE DISCLOSING PARTY AND. THE RECEIVING PARTY (COLLECTIVELY, THE PARTIES) TO PROTECT THE. CONFIDENTIALITY OF INFORMATION EXCHANGED IN CONNECTION WITH THE. MYWAY PROJECT. .. 1. PURPOSE. THE PURPOSE OF THIS AGREEMENT IS TO SAFEGUARD CONFIDENTIAL. INFORMATION AND INTELLECTUAL PROPERTY DISCLOSED BY THE DISCLOSING. PARTY IN CONNECTION WITH THE DEVELOPMENT, IMPROVEMENT, MARKETING,. AND slash OR COMMERCIALIZATION OF THE MYWAY PROJECT. THIS AGREEMENT. ESTABLISHES THE OBLIGATIONS AND RIGHTS OF THE PARTIES IN MAINTAINING. CONFIDENTIALITY AND MANAGING PROPRIETARY INFORMATION.. . 2. DEFINITION OF CONFIDENTIAL INFORMATION. FOR THE PURPOSES OF THIS AGREEMENT, CONFIDENTIAL INFORMATION. INCLUDES, BUT IS NOT LIMITED TO:. . BUSINESS STRATEGIES, PLANS, FORECASTS, AND BUDGETS. . TECHNICAL DATA, INVENTIONS, PATENTS, TRADE SECRETS, AND KNOW-HOW. . PRODUCT DESIGNS, PROTOTYPES, SCHEMATICS, AND RESEARCH DATA. . SOFTWARE SOURCE CODE, FIRMWARE, AND ALGORITHMS. . MARKETING PLANS, CUSTOMER DATA, AND SUPPLIER slash VENDOR LISTS. . FINANCIAL DATA, CONTRACTS, AND AGREEMENTS. . ANY OTHER PROPRIETARY OR SENSITIVE INFORMATION, WHETHER MARKED. AS CONFIDENTIAL OR NOT, PROVIDED IT IS IDENTIFIED AS CONFIDENTIAL. BY THE DISCLOSING PARTY.. CONFIDENTIAL INFORMATION DOES NOT INCLUDE:. (A) INFORMATION THAT BECOMES PUBLICLY AVAILABLE THROUGH NO FAULT OF. THE RECEIVING PARTY.. (B) INFORMATION INDEPENDENTLY DEVELOPED BY THE RECEIVING PARTY. WITHOUT REFERENCE TO THE CONFIDENTIAL INFORMATION.. (C) INFORMATION LAWFULLY OBTAINED FROM A THIRD PARTY WITHOUT A DUTY OF. CONFIDENTIALITY.. 3. OBLIGATIONS OF THE RECEIVING PARTY. . THE RECEIVING PARTY AGREES TO:. (A) KEEP ALL CONFIDENTIAL INFORMATION STRICTLY CONFIDENTIAL AND USE IT. ONLY FOR PURPOSES RELATED TO THE MYWAY PROJECT.. (B) RESTRICT ACCESS TO THE CONFIDENTIAL INFORMATION TO EMPLOYEES,. AGENTS, OR CONTRACTORS WHO HAVE A LEGITIMATE NEED TO KNOW AND ARE. BOUND BY CONFIDENTIALITY OBLIGATIONS AT LEAST AS STRINGENT AS THOSE IN. THIS AGREEMENT.. (C) AVOID DUPLICATING, COPYING, OR REPRODUCING THE CONFIDENTIAL. INFORMATION WITHOUT PRIOR WRITTEN CONSENT FROM THE DISCLOSING PARTY.. (D) NOTIFY THE DISCLOSING PARTY IMMEDIATELY OF ANY UNAUTHORIZED. ACCESS, USE, OR DISCLOSURE OF THE CONFIDENTIAL INFORMATION.. (E) TAKE COMMERCIALLY REASONABLE MEASURES TO SAFEGUARD THE. CONFIDENTIALITY AND INTEGRITY OF THE CONFIDENTIAL INFORMATION.. 4. PERMITTED DISCLOSURES. THE RECEIVING PARTY MAY DISCLOSE CONFIDENTIAL INFORMATION ONLY:. (A) TO COMPLY WITH APPLICABLE LAWS, REGULATIONS, OR COURT ORDERS,. PROVIDED THE DISCLOSING PARTY IS PROMPTLY NOTIFIED IN WRITING AND. GIVEN AN OPPORTUNITY TO SEEK A PROTECTIVE ORDER.. (B) TO ITS ATTORNEYS, ACCOUNTANTS, OR FINANCIAL ADVISORS FOR LEGITIMATE. BUSINESS PURPOSES, PROVIDED THEY ARE BOUND BY CONFIDENTIALITY. OBLIGATIONS.. . 5. OWNERSHIP OF CONFIDENTIAL INFORMATION. ALL CONFIDENTIAL INFORMATION, INCLUDING RELATED INTELLECTUAL PROPERTY. RIGHTS, REMAINS THE EXCLUSIVE PROPERTY OF THE DISCLOSING PARTY.. NOTHING IN THIS AGREEMENT GRANTS THE RECEIVING PARTY ANY RIGHTS, TITLE,. OR INTEREST IN THE CONFIDENTIAL INFORMATION EXCEPT AS EXPRESSLY. AUTHORIZED IN WRITING BY THE DISCLOSING PARTY.. 6. DURATION AND SURVIVAL. THIS AGREEMENT IS EFFECTIVE UPON SIGNATURE BY BOTH PARTIES AND. REMAINS IN EFFECT FOR. FIVE (5) YEARS. FROM THE DATE OF EXECUTION. THE. CONFIDENTIALITY OBLIGATIONS SHALL SURVIVE THE TERMINATION OR EXPIRATION. OF THIS AGREEMENT FOR AN ADDITIONAL. FIVE (5) YEARS. .. 7. RETURN OR DESTRUCTION OF CONFIDENTIAL INFORMATION. UPON TERMINATION OF THIS AGREEMENT OR UPON REQUEST BY THE. DISCLOSING PARTY, THE RECEIVING PARTY AGREES TO:. (A) IMMEDIATELY RETURN ALL PHYSICAL AND DIGITAL COPIES OF THE. CONFIDENTIAL INFORMATION.. (B) PERMANENTLY DELETE OR DESTROY ALL ELECTRONIC COPIES, INCLUDING. BACKUPS, AND CERTIFY SUCH DELETION OR DESTRUCTION IN WRITING.. . 8. NON-COMPETITION AND NON-SOLICITATION. FOR THE DURATION OF THIS AGREEMENT AND FOR. TWO (2) YEARS. THEREAFTER,. THE RECEIVING PARTY AGREES NOT TO:. (A) DEVELOP, MARKET, OR COMMERCIALIZE ANY PRODUCT OR SERVICE SIMILAR. TO OR COMPETITIVE WITH THE MYWAY PROJECT.. (B) SOLICIT ANY EMPLOYEES, CONTRACTORS, OR BUSINESS PARTNERS OF THE. DISCLOSING PARTY FOR COMPETING PROJECTS.. 9. AUDIT RIGHTS. THE DISCLOSING PARTY RESERVES THE RIGHT TO CONDUCT PERIODIC AUDITS OR. REVIEWS OF THE RECEIVING PARTYS COMPLIANCE WITH THIS AGREEMENT,. UPON REASONABLE NOTICE AND DURING NORMAL BUSINESS HOURS.. 10. REMEDIES FOR BREACH. IN THE EVENT OF A BREACH OR THREATENED BREACH OF THIS AGREEMENT, THE. DISCLOSING PARTY IS ENTITLED TO SEEK EQUITABLE RELIEF, INCLUDING. INJUNCTIVE RELIEF, IN ADDITION TO ANY MONETARY DAMAGES OR REMEDIES. AVAILABLE UNDER LAW.. . 11. LIMITATION OF LIABILITY. THE DISCLOSING PARTY IS NOT LIABLE FOR ANY DAMAGES ARISING FROM THE. RECEIVING PARTYS USE OR RELIANCE ON THE CONFIDENTIAL INFORMATION,. EXCEPT IN CASES OF GROSS NEGLIGENCE OR WILLFUL MISCONDUCT.. 12. GOVERNING LAW AND DISPUTE RESOLUTION. THIS AGREEMENT IS GOVERNED BY THE LAWS OF CANADA. ANY DISPUTES. ARISING UNDER THIS AGREEMENT SHALL FIRST BE RESOLVED THROUGH. GOOD-FAITH NEGOTIATION. IF UNRESOLVED, DISPUTES SHALL BE SETTLED THROUGH. ARBITRATION IN ACCORDANCE WITH THE RULES OF THE CANADIAN ARBITRATION. ASSOCIATION.. 13. AMENDMENTS AND WAIVERS. ANY AMENDMENTS TO THIS AGREEMENT MUST BE IN WRITING AND SIGNED BY. BOTH PARTIES. WAIVER OF ANY PROVISION OF THIS AGREEMENT DOES NOT. CONSTITUTE A WAIVER OF ANY OTHER PROVISION.. 14. SEVERABILITY. IF ANY PROVISION OF THIS AGREEMENT IS FOUND TO BE INVALID OR. UNENFORCEABLE, THE REMAINING PROVISIONS SHALL REMAIN IN FULL FORCE AND. EFFECT.. . 15. ENTIRE AGREEMENT. THIS AGREEMENT CONSTITUTES THE ENTIRE UNDERSTANDING BETWEEN THE. PARTIES REGARDING THE SUBJECT MATTER HEREIN AND SUPERSEDES ALL PRIOR. AGREEMENTS, DISCUSSIONS, AND COMMUNICATIONS, WHETHER WRITTEN OR. ORAL.. 16. OWNERSHIP OF WORK PRODUCT. (A). ASSIGNMENT OF INTELLECTUAL PROPERTY:. ANY INVENTIONS, DESIGNS,. CONCEPTS, PROTOTYPES, WORKS OF AUTHORSHIP, OR ANY OTHER INTELLECTUAL. PROPERTY (COLLECTIVELY REFERRED TO AS WORK PRODUCT) CREATED,. DEVELOPED, OR CONCEIVED BY THE RECEIVING PARTY, ALONE OR IN. COLLABORATION WITH OTHERS, DURING THE COURSE OF THEIR ENGAGEMENT WITH. THE MYWAY PROJECT AND RELATED ACTIVITIES, SHALL BE THE SOLE PROPERTY OF. FALLCORP TECHNOLOGIES INC.. (B). AUTOMATIC ASSIGNMENT:. THE RECEIVING PARTY AGREES THAT ALL. RIGHTS, TITLES, AND INTERESTS IN SUCH WORK PRODUCT ARE AUTOMATICALLY. ASSIGNED TO FALLCORP TECHNOLOGIES INC UPON CREATION, WITHOUT FURTHER. ACTION REQUIRED.. (C). MORAL RIGHTS WAIVER:. THE RECEIVING PARTY WAIVES ANY MORAL. RIGHTS THEY MAY HAVE IN THE WORK PRODUCT, ALLOWING FALLCORP. TECHNOLOGIES INC TO USE, MODIFY, OR REPRODUCE THE WORK PRODUCT. WITHOUT RESTRICTION.. (D). FURTHER ASSURANCES:. THE RECEIVING PARTY AGREES TO EXECUTE ANY. ADDITIONAL DOCUMENTS OR TAKE ANY ACTIONS REASONABLY REQUESTED BY. . FALLCORP TECHNOLOGIES INC TO PERFECT OR ENFORCE ITS OWNERSHIP OF THE. WORK PRODUCT.. IN WITNESS WHEREOF. , THE PARTIES HAVE EXECUTED THIS. AGREEMENT AS OF THE DATE FIRST WRITTEN ABOVE:. DISCLOSING PARTY. NAME: FALLCORP TECHNOLOGIES INC. BY: __________MALICK FALL________________. TITLE: ___________CEO_____________. DATE: ______NOVEMBER fifteen 2024___________________. RECEIVING PARTY. NAME: MICKAEL HUANG YUE CHUAN. BY: __________________________. TITLE: ________________________. DATE: _________________________. .", "NON-DISCLOSURE_AGREEMENT_NDA-Mickael_Huang_Yue_Chuan-1.pdf"], ["Audio", "23a8d936cac84bd29f40c1f554a8d461.wav", "Audio of NON-DISCLOSURE_AGREEMENT_NDA-Mickael_Huang_Yue_Chuan-1.pdf"]]